[
  {
    "date": "2026-01-01",
    "title": "He Knows Your Name",
    "titleBn": "তিনি তোমার নাম জানেন",
    "verse": "Isaiah 43:1",
    "verseText": "Fear not, for I have redeemed you; I have called you by name, you are mine.",
    "verseTextBn": "ভয় করোনা, কারণ আমি তোমাকে মুক্ত করেছি; আমি তোমাকে নামে ডেকেছি, তুমি আমার।",
    "reflection": "God's personal call means you are never anonymous to Him. He loves you in particular, not just the crowd. Redemption is His decisive act to claim you as His own. Let this quiet fear and shame: you belong. Because you are His, you can walk through uncertainty with confidence that He will guard and guide.",
    "reflectionBn": "ঈশ্বরের ডাকে তুমি কখনো অচেনা নও। তিনি ভিড় নয়, তোমাকে ব্যক্তিগতভাবে ভালোবাসেন। মুক্তি তাঁর সিদ্ধান্ত তোমাকে নিজের করার। এই সত্য ভয় ও লজ্জা শান্ত করুক: তুমি তাঁর। তুমি তাঁর বলেই অনিশ্চয়তায়ও আত্মবিশ্বাসে চলতে পারো; তিনি রক্ষা ও দিশা দেবেন।",
    "prayer": "Father, thank You for calling me by name. Silence every lie that says I'm forgotten and let my heart rest in belonging to You.",
    "prayerBn": "পিতা, আমাকে নামে ডাকার জন্য ধন্যবাদ। যে সব মিথ্যা বলে আমি ভুলে গেছি সেগুলো নীরব করুন, এবং আমার হৃদয়কে আপনার মধ্যে থাকার নিশ্চিন্ততায় বিশ্রাম দিন."
  },
  {
    "date": "2026-01-02",
    "title": "Walk By Faith",
    "titleBn": "বিশ্বাসে চলো",
    "verse": "2 Corinthians 5:7",
    "verseText": "For we walk by faith, not by sight.",
    "verseTextBn": "কারণ আমরা বিশ্বাসে চলি, দেখায় নয়।",
    "reflection": "Walking by faith means trusting God's Word over what we see. Our eyes show limitation, but faith sees His promise. Today may hold unknowns, but God is known and sure. Choosing faith is not ignoring reality but anchoring to a deeper reality: His faithfulness. Let His truth speak louder than circumstances, and step forward even when the path is unclear.",
    "reflectionBn": "বিশ্বাসে চলা মানে চোখের দেখা নয়, ঈশ্বরের বাক্যে ভরসা। চোখ সীমা দেখায়, বিশ্বাস তাঁর প্রতিশ্রুতি দেখে। আজ অজানা হতে পারে, কিন্তু ঈশ্বর জানা ও নিশ্চিত। বিশ্বাস বেছে নেওয়া বাস্তব এড়ানো নয়, গভীর বাস্তবে নোঙর করা: তাঁর বিশ্বস্ততা। তাঁর সত্য পরিস্থিতির চেয়ে জোরে বলুক, পথ অস্পষ্ট হলেও এগিয়ে যাও।",
    "prayer": "Lord, I choose faith over fear today. Help me trust Your promises and follow where You lead.",
    "prayerBn": "প্রভু, আজ আমি ভয়ের ওপর বিশ্বাস বেছে নিচ্ছি। তোমার প্রতিশ্রুতিতে ভরসা করতে এবং যেখানে তুমি পরিচালনা করো সেখানে চলতে সাহায্য করো।"
  },
  {
    "date": "2026-01-03",
    "title": "His Mercies Are New",
    "titleBn": "তাঁর করুণা নতুন",
    "verse": "Lamentations 3:22-23",
    "verseText": "Because of the Lord's great love we are not consumed, for his compassions never fail. They are new every morning; great is your faithfulness.",
    "verseTextBn": "প্রভুর মহান প্রেমের কারণে আমরা ধ্বংস হই না, কারণ তাঁর করুণা কখনও ব্যর্থ হয় না। সেগুলি প্রতিদিন সকালে নতুন; মহান আপনার বিশ্বস্ততা।",
    "reflection": "Every morning declares God's fresh compassion. Yesterday's failures don't exhaust His mercy. His love prevents our destruction, and His faithfulness guarantees tomorrow's grace. This truth frees us from shame and fuels gratitude. Start today receiving new mercy and trusting His unchanging character. He is good, and His love endures forever.",
    "reflectionBn": "প্রতিটি সকাল ঈশ্বরের তাজা করুণা ঘোষণা করে। গতকালের ব্যর্থতা তাঁর দয়া শেষ করে না। তাঁর প্রেম আমাদের ধ্বংস ঠেকায়, তাঁর বিশ্বস্ততা আগামীকালের অনুগ্রহ নিশ্চিত করে। এই সত্য লজ্জা থেকে মুক্ত করে ও কৃতজ্ঞতা জাগায়। আজ নতুন করুণা গ্রহণ করো এবং তাঁর অপরিবর্তনীয় চরিত্রে ভরসা করো। তিনি ভাল, তাঁর প্রেম চিরকাল স্থায়ী।",
    "prayer": "Father, thank You for mercies that are new this morning. Help me live today with gratitude and trust in Your unfailing love.",
    "prayerBn": "পিতা, এই সকালে নতুন করুণার জন্য ধন্যবাদ। আজ কৃতজ্ঞতা ও তোমার অব্যর্থ প্রেমে বিশ্বাসের সাথে বাঁচতে সাহায্য করো।"
  }
]
